# Программа запроса у пользователя произвольной строки и числа

# просим python вывести приветствие на экран
str_hello = print('Здравствуйте!')

user_word = input('Введите любое слово: ') # запрашиваем у пользователя слово и сохраняем в переменной
user_number = int(input('Введите любое число: ')) # запршиваем у пользователя число и сохраняем в переменной
print('Ваше слово -', user_word) # выводим на экран ранее введенное пользователем слово
print('Ваше число -', user_number) # выводим на экран ранее введенное пользователем число